ebowwa/MentraOS/mcu_client/nrf5340_ble_simulator/src/main.c
    return 0;
}
void error(void)
{
	dk_set_leds_state(DK_ALL_LEDS_MSK, DK_NO_LEDS_MSK);

	while (true) {
		/* Spin for ever */
		k_sleep(K_MSEC(1000));
	}
}

#ifdef CONFIG_BT_NUS_SECURITY_ENABLED
static void num_comp_reply(bool accept)
{
	if (accept) {
		bt_conn_auth_passkey_confirm(auth_conn);
		LOG_INF("Numeric Match, conn %p", (void *)auth_conn);
	} else {
		bt_conn_auth_cancel(auth_conn);
		LOG_INF("Numeric Reject, conn %p", (void *)auth_conn);
	}

	bt_conn_unref(auth_conn);
	auth_conn = NULL;
}
#endif /* CONFIG_BT_NUS_SECURITY_ENABLED */

void button_changed(uint32_t button_state, uint32_t has_changed)
{
	uint32_t buttons = button_state & has_changed;

	// **DEBUG: Enhanced button logging to identify spurious events**
	if ((has_changed != 0) && !(has_changed & (DK_BTN3_MSK | DK_BTN4_MSK))) // Ignore spurious changes on Button 3/4
	{
		LOG_INF("� Button Event: state=0x%02X, changed=0x%02X, pressed=0x%02X", 
		        button_state, has_changed, buttons);
	}

#ifdef CONFIG_BT_NUS_SECURITY_ENABLED
	if (auth_conn) {
		// Handle authentication buttons when in authentication mode
		if (buttons & KEY_PASSKEY_ACCEPT) {
			num_comp_reply(true);
		}

		if (buttons & KEY_PASSKEY_REJECT) {
			num_comp_reply(false);
		}
		return; // Don't handle other buttons during authentication
	}
#endif /* CONFIG_BT_NUS_SECURITY_ENABLED */

	// **NEW: Button combination for pattern cycling (Button 1 + Button 2)**
	if ((button_state & KEY_PATTERN_CYCLE) == KEY_PATTERN_CYCLE && 
	    (has_changed & (DK_BTN1_MSK | DK_BTN2_MSK))) {
		LOG_INF("🎨 Button combo 1+2: Cycling LVGL test patterns");
		display_cycle_pattern();
		return; // Don't process individual button presses when combination is active
	}

	// **NEW: Button 1 alone - Cycle battery level 0→100% and toggle charging**
	if (buttons & KEY_BATTERY_CYCLE && !(button_state & DK_BTN2_MSK)) {
		static uint8_t battery_level = 0;
		static bool charging_state = false;
		
		// Cycle battery: 0→20→40→60→80→100→0...
		battery_level += 20;
		if (battery_level > 100) {
			battery_level = 0;
		}
		
		// Toggle charging state each cycle
		charging_state = !charging_state;
		
		protobuf_set_battery_level(battery_level);
		protobuf_set_charging_state(charging_state);
		
		LOG_INF("🔋 Button 1: Battery %u%%, charging: %s", 
		        battery_level, charging_state ? "ON" : "OFF");
		return;
	}

	// **NEW: Button 2 alone - Cycle through LVGL test patterns**
	if (buttons & KEY_SCREEN_TOGGLE && !(button_state & DK_BTN1_MSK)) {
		LOG_INF("🎨 Button 2: Cycling LVGL test patterns");
		display_cycle_pattern();
		return;
	}

	// **DISABLED: Buttons 3 & 4 are ignored due to SPI4 conflicts**
	if (has_changed & (DK_BTN3_MSK | DK_BTN4_MSK)) {
		// LOG_WRN("⚠️  Buttons 3/4 disabled (SPI4 conflict on P0.08/P0.09)");
	}
}

static void configure_gpio(void)
{
	int err;

	// Always initialize buttons for battery level control
	err = dk_buttons_init(button_changed);
	if (err) {
		LOG_ERR("Cannot init buttons (err: %d)", err);
	}

	err = dk_leds_init();
	if (err) {
		LOG_ERR("Cannot init LEDs (err: %d)", err);
	}
}

// External BSP log control
extern void bsp_log_init(void);
extern int bsp_log_runtime_level;

/**
 * @brief Initialize user GPIOs (ES power and Microphone power)
 * @return 0 on success, negative value on error
 */
#define USER_NODE DT_PATH(zephyr_user)

#if DT_NODE_EXISTS(USER_NODE)
static const struct gpio_dt_spec es_power_en = GPIO_DT_SPEC_GET(USER_NODE, es_power_en_gpios);
static const struct gpio_dt_spec mic_pwr_en = GPIO_DT_SPEC_GET(USER_NODE, mic_pwr_en_gpios);

int init_user_gpio(void)
{
	int err;
	
	if (!gpio_is_ready_dt(&es_power_en))
	{
		LOG_ERR("GPIO port for es_power_en not ready");
		return -1;
	}
	
	err = gpio_pin_configure_dt(&es_power_en, GPIO_OUTPUT_HIGH | GPIO_PULL_UP);
	if (err != 0)
	{
		LOG_ERR("es_power_en config error: %d", err);
		return err;
	}
	
	if (!gpio_is_ready_dt(&mic_pwr_en))
	{
		LOG_ERR("GPIO mic_pwr_en not ready");
		return -1;
	}
	
	err = gpio_pin_configure_dt(&mic_pwr_en, GPIO_OUTPUT_HIGH | GPIO_PULL_UP);
	if (err != 0)
	{
		LOG_ERR("mic_pwr_en config error: %d", err);
		return err;
	}
	
	LOG_INF("User GPIOs configured successfully");
	return 0;
}
#else
int init_user_gpio(void)
{
	LOG_WRN("zephyr,user node not defined, skipping user GPIO initialization");
	return 0;
}
#endif

int main(void)
{
	int blink_status = 0;
	int err = 0;

	// Initialize BSP logging with disabled defaults (level 0 = DISABLED)
	bsp_log_init();
	
	// Set Zephyr log level to ERROR only for very clean startup  
	// Note: Use built-in 'log' shell commands for runtime control instead

	LOG_INF("🚀🚀🚀 MAIN FUNCTION STARTED - v2.2.0-DISPLAY_OPEN_FIX 🚀🚀🚀");
	LOG_INF("🌟🌟🌟 MAIN FUNCTION LOG_INF - v2.2.0-DISPLAY_OPEN_FIX 🌟🌟🌟\n");

	// Initialize user GPIOs (ES power and Microphone power from A6M)
	err = init_user_gpio();
	if (err != 0)
	{
		LOG_ERR("Failed to initialize user GPIOs: %d", err);
	}

	configure_gpio();

	// **NEW: Log updated button functionality (avoiding SPI4 conflicts)**
	LOG_INF("� Button controls updated (avoiding SPI4 pin conflicts):");
	LOG_INF("   � Button 1: Cycle battery 0→100%% + toggle charging");
	LOG_INF("   🎨 Button 2: Cycle LVGL test patterns");
	LOG_INF("   🎨 Button 1+2: Cycle LVGL test patterns (same as Button 2)");
	LOG_INF("   ⚠️  Buttons 3&4 disabled (SPI4 conflict P0.08/P0.09)");
	LOG_INF("   � Current battery level: %u%%", protobuf_get_battery_level());

	// Initialize brightness control
	LOG_INF("💡 LED 3 brightness control enabled:");
	LOG_INF("   📱 Mobile app can set brightness level (0-100%%)");
	LOG_INF("   📊 Current brightness level: %u%%", protobuf_get_brightness_level());
	
	// Set initial brightness to 50%
	protobuf_set_brightness_level(50);

	// err = uart_init();
	// if (err) {
	// 	error();
	// }

	if (IS_ENABLED(CONFIG_BT_NUS_SECURITY_ENABLED)) {
		err = bt_conn_auth_cb_register(&conn_auth_callbacks);
		if (err) {
			LOG_ERR("Failed to register authorization callbacks. (err: %d)", err);
			return 0;
		}

		err = bt_conn_auth_info_cb_register(&conn_auth_info_callbacks);
		if (err) {
			LOG_ERR("Failed to register authorization info callbacks. (err: %d)", err);
			return 0;
		}
	}

	err = bt_enable(NULL);
	if (err) {
		error();
	}
	
	LOG_INF("Bluetooth initialized");

