ebowwa/MentraOS/mcu_client/nrf5340_ble_simulator/src/main.c
	k_sem_give(&ble_init_ok);

	if (IS_ENABLED(CONFIG_SETTINGS)) {
		settings_load();
	}

	err = mentra_ble_init(&mentra_cb);
	if (err) {
		LOG_ERR("Failed to initialize Mentra BLE service (err: %d)", err);
		return 0;
	}
	bt_gatt_cb_register(&gatt_callbacks);
	// Initialize PDM audio streaming system
	LOG_INF("🎤 Initializing PDM audio streaming system...");
	err = pdm_audio_stream_init();
	if (err) {
		LOG_ERR("Failed to initialize PDM audio streaming (err: %d)", err);
		// Continue without audio streaming capability
	} else {
		LOG_INF("✅ PDM audio streaming system ready");
		LOG_INF("📱 Mobile app can enable/disable microphone via MicStateConfig (Tag 20)");
	}

	// Initialize ping/pong connectivity monitoring system
	LOG_INF("📡 Initializing ping/pong connectivity monitoring...");
	protobuf_init_ping_monitoring();
	LOG_INF("✅ Ping monitoring started - glasses will ping phone every 10 seconds");
	LOG_INF("📱 Phone should respond with pong messages to maintain connection");

	// Initialize LVGL display system with working driver implementation
	LOG_INF("🔥🔥🔥 About to initialize LVGL display system... 🔥🔥🔥\n");
	
	// Start the LVGL display thread first!
	LOG_INF("🧵 Starting LVGL display thread...");
	lvgl_display_thread();
	LOG_INF("✅ LVGL display thread started!");
#if 0
        // Give the thread a moment to initialize
        k_msleep(100);
        
        // Send LCD_CMD_OPEN to start the LVGL display system
        LOG_INF("📡📡📡 Calling display_open() NOW... 📡📡📡\n");
        display_open();
        LOG_INF("✅ display_open() call completed!");
        
        // Add direct A6N test from main thread
        LOG_INF("🖥️ Testing A6N display from main thread...");
        const struct device *test_disp = DEVICE_DT_GET(DT_CHOSEN(zephyr_display));
        if (device_is_ready(test_disp)) {
            LOG_INF("✅ A6N device ready in main: %s", test_disp->name);
            
            // Try to turn off blanking
            int ret = display_blanking_off(test_disp);
            LOG_INF("📺 Display blanking off result: %d", ret);
            
            // Try a simple write operation
            uint8_t test_data[8] = {0xFF, 0xFF, 0xFF, 0xFF, 0x00, 0x00, 0x00, 0x00};
            struct display_buffer_descriptor desc = {
                .buf_size = 8,
                .width = 4,
                .height = 1,
                .pitch = 4,
            };
            
            ret = display_write(test_disp, 0, 0, &desc, test_data);
            LOG_INF("🎨 Display write result: %d", ret);
            
            if (ret == 0) {
                LOG_INF("🎉 SUCCESS: A6N write operation completed!");
            } else {
                LOG_ERR("❌ FAILED: A6N write operation failed: %d", ret);
            }
        } else {
            LOG_ERR("❌ A6N device not ready in main");
        }
        
        // The LVGL demo thread is already defined in lvgl_demo.c - no need to call it here
        LOG_INF("LVGL demo thread will start automatically");
#endif
	k_work_init(&adv_work, adv_work_handler);
	advertising_start();
	opt3006_initialize();
	pm1300_init();
	usb_detect_init();
	
	for (;;) {
		dk_set_led(RUN_STATUS_LED, (++blink_status) % 2);
		k_sleep(K_MSEC(RUN_LED_BLINK_INTERVAL));

	}
}

void ble_write_thread(void)
{
	/* Don't go any further until BLE is initialized */
	k_sem_take(&ble_init_ok, K_FOREVER);
	struct uart_data_t mentra_data = {
		.len = 0,
	};

	for (;;) {
		/* Wait indefinitely for data to be sent over bluetooth */
		struct uart_data_t *buf = k_fifo_get(&fifo_uart_rx_data,
						     K_FOREVER);

		int plen = MIN(sizeof(mentra_data.data) - mentra_data.len, buf->len);
		int loc = 0;

		while (plen > 0) {
			memcpy(&mentra_data.data[mentra_data.len], &buf->data[loc], plen);
			mentra_data.len += plen;
			loc += plen;

			if (mentra_data.len >= sizeof(mentra_data.data) ||
			   (mentra_data.data[mentra_data.len - 1] == '\n') ||
			   (mentra_data.data[mentra_data.len - 1] == '\r')) {
				if (mentra_ble_send(current_conn, mentra_data.data, mentra_data.len)) {
					LOG_WRN("Failed to send data over BLE connection");
				}
				mentra_data.len = 0;
			}

			plen = MIN(sizeof(mentra_data.data), buf->len - loc);
		}

		k_free(buf);
	}
}

K_THREAD_DEFINE(ble_write_thread_id, STACKSIZE, ble_write_thread, NULL, NULL,
		NULL, PRIORITY, 0, 0);



static int hfclock_config_and_start(void)
{
	int ret;
	/* Use this to turn on 128 MHz clock for cpu_app */
	ret = nrfx_clock_divider_set(NRF_CLOCK_DOMAIN_HFCLK, NRF_CLOCK_HFCLK_DIV_1);
	ret -= NRFX_ERROR_BASE_NUM;
	if (ret)
	{
		return ret;
	}
	nrfx_clock_hfclk_start();
	while (!nrfx_clock_hfclk_is_running())
	{
	}
	return 0;
}
SYS_INIT(hfclock_config_and_start, POST_KERNEL, 0);
